Revit 2024 API
Selection Properties
The Selection type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Selection Class
Autodesk.Revit.UI.Selection Namespace